Autodesk.Revit.DB.Electrical.CableTraySettings.GetCableTraySettings(Autodesk.Revit.DB.Document)
Gets the cable tray settings of the project.
document:
The document.
Returns:
The cable tray settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.UseAnnotationScaleForSingleLineFittings
Indicates whether use annotation scale for single line fittings or not.
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.RiseDropAnnotationSize
The rise drop annotation size.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for riseDropAnnotationSize must be between 0 and 30000 feet.
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.FittingAnnotationSize
The value of fitting annotation size.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for fittingAnnotationSize must be between 0 and 30000 feet.
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.ConnectorSeparator
The cable tray connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSuffix
The cable tray size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSeparator
The cable tray size separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.CableTraySettings
The cable tray settings.
Since:
2017